Repository: 84000/data-translation-memory
Catalog: toh139-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Dhāraṇī of the Vajra Quintessence

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་གངས་ཀྱི་རི་དང་ཉེ་བ་སྣ་ཚོགས་ཀྱི་གྲོང་གི་རྩྭའི་སྤྱིལ་པོ་ན། དགེ་སློང་སྟོང་དུ་ཚང་བའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was in a grass hut in the town of Viśvā near the snow-peaked Himalayan mountains where he dwelled with a great assembly of one thousand monks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་བསོད་སྙོམས་ཀྱི་ཟན་ཕྱིས་ལེན་པ་སྤངས་ཏེ། རྩྭའི་སྤྱིལ་པོར་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་སྐུ་དྲང་པོར་བསྲང་སྟེ། དྲན་པ་མངོན་དུ་བཞག་ནས་བཞུགས་སོ།
en: At that time, the Blessed One, avoiding eating alms-food after noon, sat upright in that grass hut with his legs crossed and remained there, settled in mindfulness.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་དུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །བཅོམ་ལྡན་འདས་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དགེ་སློང་གི་དགེ་འདུན་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ད་ལྟར་ག་ལ་བཞུགས་པའི་སྐུ་མ་མཐོང་ངོ་།
en: Then the Blessed One entered the meditative absorption called dwelling with equality toward all phenomena, and as soon as the Blessed One had entered that absorption, the whole assembly of monks could not see a body where the Blessed One was seated.

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་སུམ་ཁྲི་ཉིས་སྟོང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ངོ་།
en: At this point, through the power of the Buddha, Śakra, lord of the gods; Brahmā, lord of the Sahā world; and thirty-two thousand minor gods of the Śuddhāvāsa realms went to where the Buddha was staying.

source: །དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་འདི་སྙམ་དུ། བཅོམ་ལྡན་འདས་ད་ལྟར་གང་ན་བཞུགས་སྙམ་དུ་སེམས་པ་དང་། བཅོམ་ལྡན་འདས་རྩྭའི་སྤྱིལ་པོའི་ནང་ན་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་དེ་དག་གིས་མཐོང་ངོ་། །མཐོང་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཅང་མི་སྨྲ་བར་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ།
en: The lord of the gods, Śakra, and Brahmā, the lord of the Sahā world, wondered, “Where is the Buddha dwelling right now?” When they saw that the Blessed One had entered into meditative concentration in that grass hut, they went to where he was and sat before him in silence with their legs crossed.

source: །གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱང་ཅང་མི་སྨྲ་བར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་དེ་ཉིད་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ།
en: The many gods of the Śuddhāvāsa realms also sat before him in silence with their legs crossed.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་དོ། །ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་པས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་ཐེག་པ་ལ་གསར་དུ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་ནས་རིང་དུ་ལོན་པའམ། ཕྱིར་མི་ལྡོག་པའམ། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ཡང་རུང་སྟེ། ཇི་སྙེད་འཁོད་པ་དེ་དག་ཐམས་ཅད་སྣ་ཚོགས་ཀྱི་གྲོང་ག་ལ་བ་དང་། རྩྭའི་སྤྱིལ་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། སངས་རྒྱས་ཀྱི་མཐུས་མི་གང་ཙམ་གྱི་བར་སྣང་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ།
en: At that point the Blessed One performed a miracle such that his miraculous power caused all the beings in this trichiliocosm that belong to the Bodhisattva Vehicle—whether they had newly entered that vehicle, had entered it long ago, had reached the stage of nonregression, or had just one lifetime to go before reaching awakening—to proceeded to that grass hut in the vicinity of the town of Viśvā. And after they had arrived, due to the Buddha’s power, they hovered in midair at the height of a human being with their legs crossed.

source: །དེ་ནས་དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མགུ་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: It was then that Mañjuśrī Kumārabhūta entered the meditative absorption called pleasing the minds of all sentient beings.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཏིང་ངེ་འཛིན་འདི་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་འཁོར་དེ་དག་ཐམས་ཅད་སེམས་རབ་ཏུ་དགའ་བ་དང་། སེམས་མགུ་བ་དང་། སེམས་རངས་པ་དང་། སེམས་ཤིན་ཏུ་ཚིམ་པ་སྐྱེས་སོ།
en: As soon as he had entered it, the minds of the entire assembly became happy, pleased, overjoyed, and deeply satisfied.

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཞི་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: The bodhisattva Maitreya also entered the meditative absorption called quelling all phenomena.

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱི་དབང་པོ་རྣམས་རབ་ཏུ་ཞི་བར་གནས་སོ།
en: Immediately thereafter, the faculties of the entire assembly were in a state of stillness.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བ། །བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཁྲི་ཉིས་སྟོང་དང་། ལྷན་ཅིག་ཏུ་སྣ་ཚོགས་ཀྱི་གྲོང་ག་ལ་བ་དང་། རྩྭའི་སྤྱིལ་པོ་ག་ལ་བ་དེར་སོང་སྟེ།
en: Then the bodhisattva Ratnaketu went to that grass hut in the vicinity of the town of Viśvā with a retinue of sixty-two thousand bodhisattvas.

source: ཕྱིན་མ་ཐག་ཏུ་བདག་ཉིད་སྟེང་གི་ནམ་མཁའ་བར་སྣང་ལ་འདུག་པ་སྙམ་དུ་ཤེས་ཏེ། དེ་སྟེང་གི་ནམ་མཁའ་དེ་ཉིད་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ།
en: As soon as they arrived, they each thought, “I’ll take a seat in space directly above,” and they hovered directly above with their legs crossed.

source: །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་བཀོད་པ་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་བར་སྣང་ཐམས་ཅད་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་ཀུན་ཏུ་ཁེབས་ནས། ཉི་མ་དང་། ཟླ་བ་རྣམས་ཀྱི་འོད་ཀྱང་མི་སྣང་བར་གྱུར་ཏོ།
en: Then Ratnaketu entered the meditative absorption called great array, and as soon as he did the sky was so completely filled with the blooms of lotuses and water lilies of different kinds and colors that the rays of the sun and the moon were no longer visible.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག །བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཁྲི་ཉིས་སྟོང་དང་ལྷན་ཅིག་ཏུ་སྟེང་གི་ནམ་མཁའ་ལས་སྣ་ཚོགས་ཀྱི་གྲོང་ཁྱེར་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ས་ལ་འདུག་མ་ནུས་ནས། དེ་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་མ་དེ་དག་དང་། ལྷན་ཅིག་ཏུ་སྟེང་གི་བར་སྣང་ནམ་མཁའ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་གོ།
en: At that point, the bodhisattva Avalokiteśvara came from the sky above to the vicinity of the town of Viśvā where the Blessed One was staying with a retinue of sixty-two thousand bodhisattvas. Unable to find room on the ground, he and the rest of those bodhisattvas took their a seat in the sky above with their legs crossed.

source: །འདུག་མ་ཐག་ཏུ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་འཇོམས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག །ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་འཁོར་དེ་དག་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཏོ།
en: As soon as they were seated, the bodhisattva Avalokiteśvara entered the meditative absorption called overcoming the emotional defilements of all sentient beings, and the entire assembly gathered there was immediately free of desire, anger, confusion, and all other defilements.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་སྟེང་གི་བར་སྣང་ལ་འཕགས་ནས་འཛུམ་པ་མཛད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ངོ་།
en: Then the Blessed One rose into the sky above and smiled, and light rays of myriad colors—blue, yellow, red, white, orange, crystal, and silver—shone from his mouth.

source: །དེ་ནས་དེའི་ཚེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྟེང་གི་བར་སྣང་ལ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་བར་སྣང་དེ་ཉིད་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐར་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་གང་ལགས།
en: In the sky above, Mañjuśrī Kumārabhūta covered one shoulder with his robe, knelt there in the sky on his right knee, bowed toward the Blessed One with his palms together, and asked, “Blessed One, why did you smile?

source: རྐྱེན་ནི་གང་ལགས།
en: What caused you to do that?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བར་སྣང་འདིར་སངས་རྒྱས་ཁྲི་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ཞེས་བྱ་བ་བཤད་དེ། ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: “Mañjuśrī,” the Blessed One replied, “the tens of thousands of buddhas here in the sky have explained and correctly taught the dhāraṇī of the vajra quintessence to the bodhisattvas.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་ད་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་རྣམས་ལ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་བཤད་དུ་གསོལ།
en: Mañjuśrī said, “I request the Blessed One to teach the dhāraṇī of the vajra quintessence to all the bodhisattvas here now as well.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོག་གོ།
en: “I accept your request, Mañjuśrī.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་བྱང་ཆུབ་ཀྱང་མེད། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མེད་ན། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་དོ།
en: In this dhāraṇī of the vajra quintessence there is no awakening and there is no buddha, yet these bodhisattvas wish to awaken to the completely perfect awakening of a buddha.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་འཁོར་བ་ཡང་མེད། མྱ་ངན་ལས་འདས་པ་ཡང་མེད་ན། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no saṃsāra and no nirvāṇa, yet these bodhisattvas wish to attain nirvāṇa.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་དགེ་བ་ཡང་མེད། མི་དགེ་བ་ཡང་མེད་ན། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་མི་དགེ་བ་སྤོང་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no virtue and no nonvirtue, yet these bodhisattvas wish to avoid nonvirtue.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་ཕ་རོལ་ཡང་མེད། ཚུ་རོལ་ཡང་མེད་ན། འདི་དག་ནི་ཕ་རོལ་ཏུ་འགྲོ་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no other shore or this shore, yet these bodhisattvas wish to reach the other shore.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་ཞིང་ཡང་མེད། ཞིང་ཡོངས་སུ་གྲུབ་པ་ཡང་མེད་ན། འདི་དག་ནི་ཞིང་ཡོངས་སུ་བསྒྲུབ་པར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no ordinary realm nor perfection of a realm, yet these bodhisattvas wish to perfect a realm.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་བདུད་ཀྱང་མེད། བདུད་དུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་བདུད་འདུལ་བར་འདོད་དོ།
en: “In the dhāraṇī of the vajra quintessence there is no Māra nor even the label ‘Māra,’ yet these bodhisattvas wish to tame Māra.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་ཉན་ཐོས་ཀྱང་མེད། ཉན་ཐོས་སུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་ཉན་ཐོས་ཀྱི་ཆོས་ལས་འདའ་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no hearer nor even the label ‘hearer,’ and yet these bodhisattvas wish to go beyond the teachings of the hearers.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་རང་སངས་རྒྱས་ཀྱང་མེད་དེ། རང་སངས་རྒྱས་སུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཆོས་ལས་འདའ་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no solitary buddha nor even the label ‘solitary buddha,’ yet these bodhisattvas wish to go beyond the teachings of the solitary buddhas.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་སེམས་ཅན་ཡང་མེད། སེམས་ཅན་དུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་སེམས་ཅན་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no sentient being nor even the label ‘sentient being,’ yet these bodhisattvas wish to help sentient beings attain nirvāṇa.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་དོན་ཀྱང་མེད། དོན་མ་ཡིན་པ་ཡང་མེད་ན། འདི་དག་ནི་དོན་བྱེད་པར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no benefit nor lack of benefit, yet these bodhisattvas wish to be of benefit.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་འདོད་ཆགས་ཀྱང་མེད། འདོད་ཆགས་སུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་འདོད་ཆགས་སྤོང་བར་འདོད་དོ།
en: “In the dhāraṇī of the vajra quintessence there is no desire nor even the label ‘desire,’ yet these bodhisattvas wish to abandon desire.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་ཞེ་སྡང་ཡང་མེད། ཞེ་སྡང་དུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་ཞེ་སྡང་སྤོང་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no anger nor even the label ‘anger,’ yet these bodhisattvas wish to abandon anger.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་གཏི་མུག་ཀྱང་མེད། གཏི་མུག་ཏུ་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་གཏི་མུག་སྤོང་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no confusion nor even the label ‘confusion,’ yet these bodhisattvas wish to abandon confusion.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་ཤེས་པ་ཡང་མེད། མི་ཤེས་པ་ཡང་མེད་ན། འདི་དག་ནི་ཤེས་པ་མངོན་སུམ་དུ་བྱེད་པར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no knowing or unknowing, yet these bodhisattvas wish to attain knowledge.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་མེད། ཀུན་ནས་ཉོན་མོངས་པར་གདགས་པ་ཡང་མེད་ན། འདི་དག་ནི་ཀུན་ནས་ཉོན་མོངས་པ་སྤོང་བར་འདོད་དོ།
en: In the dhāraṇī of the vajra quintessence there is no pollution nor even the label ‘pollution,’ yet these bodhisattvas wish to abandon pollution.

source: །རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ལ་རྣམ་པར་བྱང་བ་ཡང་མེད། རྣམ་པར་བྱང་བར་གདགས་པ་ཡང་མེད། འདུལ་བ་ཡང་མེད། འདུལ་བ་མ་ཡིན་པ་ཡང་མེད།
en: “In the dhāraṇī of the vajra quintessence there is no purification nor even the label ‘purification.’ There is neither moral training nor nontraining.

source: བྱམས་པ་ཡང་མེད། སྙིང་རྗེ་ཡང་མེད། དགའ་བ་ཡང་མེད། བཏང་སྙོམས་ཀྱང་མེད།
en: There is no compassion, no loving kindness, nor feeling desirous or neutral toward anything.

source: སྦྱིན་པ་ཡང་མེད། སེར་སྣ་ཡང་མེད།
en: There is neither generosity nor stinginess.

source: ཚུལ་ཁྲིམས་ཀྱང་མེད། འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱང་མེད།
en: There is neither intact moral training nor broken training.

source: བཟོད་པ་ཡང་མེད། གནོད་སེམས་ཀྱང་མེད།
en: There is neither patience nor malice.

source: བརྩོན་འགྲུས་ཀྱང་མེད། ལེ་ལོ་ཡང་མེད།
en: There is neither diligence nor laziness.

source: བསམ་གཏན་ཡང་མེད། རྣམ་པར་གཡེང་བ་ཡང་མེད།
en: There is neither concentration nor distraction.

source: ཤེས་རབ་ཀྱང་མེད། འཆལ་བའི་ཤེས་རབ་ཀྱང་མེད།
en: There is neither insight nor mental error.

source: ལྟུང་བ་ཡང་མེད། མི་ལྟུང་བ་ཡང་མེད།
en: There is neither moral downfall nor what is not a downfall.

source: ཉན་ཐོས་ཀྱང་མེད། རང་སངས་རྒྱས་ཀྱང་མེད། དེ་བཞིན་གཤེགས་པ་ཡང་མེད།
en: There are no hearers, solitary buddhas, or thus-gone ones.

source: ཆོས་ཀྱང་མེད། ཆོས་མ་ཡིན་པ་ཡང་མེད།
en: There is neither Dharma nor non-Dharma.

source: ཟབ་མོ་མ་ཡིན་པ་ཡང་མེད། སླ་བ་ཡང་མེད།
en: There are neither profound points nor simple ones.

source: ཤེས་པ་ཡང་མེད། མི་ཤེས་པ་ཡང་མེད།
en: There is neither knowing nor not knowing.

source: ཐོབ་པ་ཡང་མེད།
en: There is no attainment.

source: མངོན་པར་རྟོགས་པ་ཡང་མེད།
en: There is no realization.

source: འཁོར་བ་ཡང་མེད། མྱ་ངན་ལས་འདས་པ་ཡང་མེད།
en: There is no saṃsāra or nirvāṇa.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་མེད། ཡང་དག་པར་སྤོང་བ་རྣམས་ཀྱང་མེད། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ཀྱང་མེད། དབང་པོ་རྣམས་ཀྱང་མེད། སྟོབས་རྣམས་ཀྱང་མེད། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱང་མེད། ལམ་ཡང་མེད་དོ།
en: There are no applications of mindfulness, no right exertions, no bases of miraculous power, no faculties, no powers, no branches of awakening, and no path.

source: །འཇམ་དཔལ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ཐོབ་པར་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔས་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་ལ་གནས་པར་མི་བྱའོ།
en: “Mañjuśrī, bodhisattvas wishing to attain the dhāraṇī of the vajra quintessence should not dwell in the qualities of ordinary people.

source: །སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་གཟུང་བར་མི་བྱ། དོར་བར་མི་བྱ།
en: They should not uphold the qualities of ordinary people. Nor should they reject them.

source: རྣམ་པར་བསྒྲུབ་པར་མི་བྱ།འདའ་བར་མི་བྱ། འཕོ་བར་མི་བྱ། བཏང་སྙོམས་སུ་གནས་པར་མི་བྱ།
en: They should not try to accomplish such things, and they should not try to surpass them, transgress them, or consider them neutrally.

source: བསམ་པར་མི་བྱ། མངོན་པར་འབྱུང་བར་མི་བྱ། ལེ་ལོར་མི་བྱ། ཆགས་པར་མི་བྱ། མི་ཆགས་པར་མི་བྱ། ཡོངས་སུ་ཡི་ཆད་པར་མི་བྱ། རེག་པར་མི་བྱའོ།།
en: They should not think about such qualities, spiritually renounce them, become lazy about them, be attached to them, be unattached to them, be completely cut off from them, or try to make contact with them.

source: །སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པར་འདུ་ཤེས་བསྐྱེད་པར་མི་བྱ།
en: “You should not perceive the qualities of ordinary people as polluted.

source: སྦྱིན་པར་འདུ་ཤེས་བསྐྱེད་པར་མི་བྱ།
en: You should not consider them as something one is given.

source: བཏང་བར་འདུ་ཤེས་བསྐྱེད་པར་མི་བྱའོ།
en: You should also not consider them as something to be given up.

source: །སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་སུ་མ་གཏོགས་པར་བལྟ་བར་མི་བྱ།
en: “The qualities of ordinary people should not be viewed as distinct from the qualities of buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་དང་སྦྱར་བར་མི་བྱ། སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སྦྱར་བར་མི་བྱ།
en: Nor should the qualities of buddhas be conflated with the qualities of ordinary people, or qualities of ordinary people be conflated with the qualities of buddhas.

source: སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་དམིགས་པར་མི་བྱ།
en: The qualities of ordinary people should not be objectified.

source: ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སྦྱར་བར་མི་བྱའོ།
en: They should also not be conflated with the qualities of the hearers or solitary buddhas.

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཟུང་བར་མི་བྱ། སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱང་དོར་བར་མི་བྱ། སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་བསྲུང་བར་བྱ།
en: “The qualities of buddhas should not be upheld, and the qualities of ordinary people should not be abandoned or maintained.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ལ་ཡང་གནས་པར་མི་བྱ་སྟེ། སྨོན་ལམ་ཡང་མི་གཏོང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Bodhisattvas should also not dwell in perfectly pure buddha realms, nor aspire to them. Why not?

source: འཇམ་དཔལ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ནི་རྣམ་པར་མི་རྟོག་པ་སྟེ།
en: Because, Mañjuśrī, the dhāraṇī of the vajra quintessence is nonconceptual.

source: འདོད་ཆགས་སུ་ཡང་དག་པར་འདུ་བ། ཞེ་སྡང་དུ་ཡང་དག་པར་འདུ་བ། གཏི་མུག་ཏུ་ཡང་དག་པར་འདུ་བ། བུད་མེད་དུ་ཡང་དག་པར་འདུ་བ། སྐྱེས་པར་ཡང་དག་པར་འདུ་བ། ལྷར་ཡང་དག་པར་འདུ་བ། ཀླུར་ཡང་དག་པར་འདུ་བ། གནོད་སྦྱིན་དུ་ཡང་དག་པར་འདུ་བ། དྲི་ཟར་ཡང་དག་པར་འདུ་བ། ལྷ་མ་ཡིན་དུ་ཡང་དག་པར་འདུ་བ། ནམ་མཁའ་ལྡིང་དུ་ཡང་དག་པར་འདུ་བ། ལྟོ་འཕྱེ་ཆེན་པོར་ཡང་དག་པར་འདུ་བ།
en: It is immanent in desire, immanent in anger, immanent in confusion, immanent in women, immanent in men, and immanent in gods, in nāgas, in yakṣas, in gandharvas, in asuras, in garuḍas, and in mahoragas.

source: སངས་རྒྱས་སུ་ཡང་དག་པར་འདུ་བ། ཆོས་སུ་ཡང་དག་པར་འདུ་བ། དགེ་འདུན་དུ་ཡང་དག་པར་འདུ་བ། ཉན་ཐོས་སུ་ཡང་དག་པར་འདུ་བ། རང་སངས་རྒྱས་སུ་ཡང་དག་པར་འདུ་བ། སེམས་ཅན་དམྱལ་བར་ཡང་དག་པར་འདུ་བ། དུད་འགྲོའི་སྐྱེ་གནས་སུ་ཡང་དག་པར་འདུ་བ། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་ཡང་དག་པར་འདུ་བ།
en: It is immanent in the Buddha, in the Dharma, in the Saṅgha, and in hearers, solitary buddhas, the hell realms, the animal realm, and in the world of Yama.

source: ངན་པར་ཡང་དག་པར་འདུ་བ། བཟང་པོར་ཡང་དག་པར་འདུ་བ། སར་ཡང་དག་པར་འདུ་བ། ཆུར་ཡང་དག་པར་འདུ་བ། མེར་ཡང་དག་པར་འདུ་བ། རླུང་དུ་ཡང་དག་པར་འདུ་བ། མིག་ཏུ་ཡང་དག་པར་འདུ་བ། རྣ་བར་ཡང་དག་པར་འདུ་བ། སྣར་ཡང་དག་པར་འདུ་བ། ལྕེར་ཡང་དག་པར་འདུ་བ། ལུས་སུ་ཡང་དག་པར་འདུ་བ། ཡིད་དུ་ཡང་དག་པར་འདུ་བ་སྟེ། འཇམ་དཔལ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་ནི་ཆོས་ཐམས་ཅད་དུ་ཡང་དག་པར་འདུ་བའོ།
en: It is immanent in evil, in good, in earth, water, fire, and air, and in the eyes, ears, nose, tongue, body, and mind. Mañjuśrī, the dhāraṇī of the vajra quintessence is immanent in all things.

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ། དཔེར་ན་ཤར་ཕྱོགས་ཀྱི་ནམ་མཁའི་ཁམས་གང་ཡིན་པ་དང་། ལྷོ་ཕྱོགས་ཀྱི་གང་ཡིན་པ་དང་། ནུབ་ཕྱོགས་ཀྱི་གང་ཡིན་པ་དང་། བྱང་ཕྱོགས་ཀྱི་གང་ཡིན་པ་དང་། འོག་གི་གང་ཡིན་པ་དང་། སྟེང་གི་ནམ་མཁའི་ཁམས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ནམ་མཁའི་ཁམས་སུ་ཡང་དག་པར་འདུ་བར་འགྱུར་བ་དེ་བཞིན་དུ་འཇམ་དཔལ་རྡོ་རྗེའི་སྙིང་པོའི་གཟུངས་འདི་ཡང་ཆོས་ཐམས་ཅད་དུ་ཡང་དག་པར་འདུ་བར་འགྱུར་རོ།
en: “Mañjuśrī, just as the element of space in the east, the element of space in the south, the element of space in the west, the element of space in the north, the element of space below, and the element of space above are all immanent in the element of space, so too, Mañjuśrī, this dhāraṇī of the vajra quintessence is likewise immanent in all things.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་འདོད་ཆགས་གཟུངས་ཀྱི་གཞི་ལགས།
en: Mañjuśrī Kumārabhūta then asked the Blessed One, “Blessed One, how could desire be a basis of the dhāraṇī?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདོད་ཆགས་འདོད་ཆགས་ཞེས་བྱ་བ་ནི་ཤར་ཕྱོགས་ནས་འོངས་ཏེ་སེམས་ཅན་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པར་བྱེད་པ་མ་ཡིན།
en: The Buddha replied, “Mañjuśrī, what we call desire is not something that pollutes sentient beings after coming from the east.

source: ལྷོ་ཕྱོགས་ནས་མ་ཡིན། ནུབ་ཕྱོགས་ནས་མ་ཡིན། བྱང་ཕྱོགས་ནས་མ་ཡིན། འོག་ནས་མ་ཡིན། སྟེང་གི་ཕྱོགས་ནས་མ་འོངས་ཏེ།
en: Nor is it something from the south, from the west, from the north, from below, or from above.

source: སེམས་ཅན་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པར་བྱེད་པ་མ་ཡིན་ནོ། །ནང་ནས་སྐྱེས་ཏེ། སེམས་ཅན་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པར་བྱེད་པ་མ་ཡིན། ཕྱི་རོལ་ནས་ཀྱང་མ་ཡིན་ནོ།
en: It is not something that pollutes sentient beings after arising from within, nor is it something that pollutes sentient beings after arising from without.

source: །འཇམ་དཔལ་གལ་ཏེ་འདོད་ཆགས་ནང་ནས་ལངས་ཏེ་སེམས་ཅན་རྣམས་ལ་ཀུན་ནས་ཉོན་མོངས་པར་བྱེད་ན་ནི། དེའི་ཕྱིར་སེམས་ཅན་རྣམས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་ཉིད་དུ་འགྱུར་ཏེ། ཕྱིས་ཀྱང་ཆོས་མངོན་པར་རྟོགས་པར་མི་འགྱུར་རོ།
en: Mañjuśrī, if desire were something that polluted sentient beings after arising from within, then it would follow that sentient beings have pollution as their very nature, and would not be able to realize reality at some later time.

source: །འཇམ་དཔལ་ཆོས་ནི་མི་འོང་། མི་འགྲོ །ནང་ན་མི་འདུག །ཕྱི་རོལ་ན་ཡང་མི་འདུག །གཉིས་ཀ་མེད་པར་ཡང་མི་འདུག་སྟེ།
en: Mañjuśrī, phenomena do not come, nor do they go, nor do they stay either within or without. They also do not stay in a way that is neither of these two.

source: དེ་ལ་བགྲང་བ་གང་ཡང་མེད་དེ།
en: They are completely beyond reckoning.

source: དེས་ན་འདོད་ཆགས་ནི་གཟུངས་ཀྱི་གཞི་ཞེས་བྱའོ།
en: Therefore, desire is said to be a basis of the dhāraṇī.

source: །ཞེ་སྡང་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Anger is a basis of the dhāraṇī.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཞེ་སྡང་གཟུངས་ཀྱི་གཞི་ལགས།
en: “Blessed One, how could anger be a basis of the dhāraṇī?” asked Mañjuśrī.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་ཞེ་སྡང་ནི་ཅ་ཅོ་བཏོན་པ་ལས་འབྱུང་སྟེ།
en: The Blessed One replied, “Mañjuśrī, anger arises from spouting senseless drivel.

source: ཅ་ཅོ་བཏོན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ།
en: But this spouting of senseless drivel is not past, nor is it future, nor does it arise in the present.

source: །འཇམ་དཔལ་གལ་ཏེ་འདས་པ་ལས་ཆོས་རྣམས་བྱུང་དུ་ཟིན་ན་རྟག་པར་འགྱུར་རོ།
en: Mañjuśrī, if such phenomena were deemed to have come from the past, they would be permanent.

source: །འཇམ་དཔལ་མ་འོངས་པའི་རྐྱེན་རྣམས་ལས་ཀྱང་ཞེ་སྡང་འབྱུང་བ་མེད་དོ། །ད་ལྟར་གྱི་རྐྱེན་ཀྱང་འདུག་པ་མེད་ཅིང་མ་འགགས་པའོ།
en: Anger does not arise from future conditions, and present conditions also neither persist nor cease.

source: །འཇམ་དཔལ་ཆོས་གང་འདས་པ་ལས་མ་བྱུང་། མ་འོངས་པ་ལས་ཀྱང་མ་ཡིན། ད་ལྟར་གྱི་ལས་ཀྱང་མ་ཡིན་པ་དེ་ནི་དུས་གསུམ་ཡོངས་སུ་དག་པའི་གཟུངས་ཀྱི་གཞི་ཞེས་བྱའོ།
en: Mañjuśrī, any phenomena that are not arisen from the past, or from the future, or from the present—such phenomena are called the basis of the dhāraṇī that is purified in the three times.

source: །འཇམ་དཔལ་གཏི་མུག་ནི་གཟུངས་ཀྱི་གཞིའོ།
en: “Mañjuśrī, confusion is a basis of the dhāraṇī.”

source: །གསོལ་པ།བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་གཏི་མུག་གཟུངས་ཀྱི་གཞི་ལགས།
en: “Blessed One, how could confusion be a basis of the dhāraṇī?” asked Mañjuśrī.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་གཏི་མུག་ནི་མ་རིག་པ་ལས་བྱུང་སྟེ།
en: The Blessed One replied, “Mañjuśrī, confusion arises from ignorance.
